import java.util.Arrays;
import java.util.Scanner;
import java.util.Random;

public class lesson3 {

    public static void main(String[] a6rgs)
    {
        //  Завдання 1: Создать массив integers, и с помощью класса scanner определить его размер,
        // например - int [] array = new int [ ' тут должно быть число со сканнера'],
        // далее заполнить этот массив данными (любыми, используя цикл for) и потом вывести все значения на экран, так же используя цикл for

        Scanner scanner = new Scanner(System.in);
        Random random = new Random();
        System.out.println("Введіть довжину масиву який хочете створити: ");
        int[] array = new int[scanner.nextInt()]; // Визначення довжини масиву за допомогою сканеру

        for (int i = 0; i < array.length; i++) // Заповнення масиву рандомними значеннями від 1 до 100
        {
            array [i] = random.nextInt(100) + 1;
        }
    System.out.println("Створений масив: " +Arrays.toString(array)); // Вивід всіх значень масиву

        System.out.println("Далі бубуть виводитись елементи масиву по черзі: ");
        for (int i = 0; i < array.length; i++) // Вивід всіх значень масиву за допомогою циклу for
        {
            System.out.println(array [i]);
        }


        // Завдання 2. Используя вложенный цикл for, вывести на экран таблицу умножения
        // только наоборот с начало умножение на 9 ( как делали на занятии)
        System.out.println("Таблиця множення від 9*9 до 1*1: ");
        for (int i = 9; i > 0; i--) // Таблиця множення навпаки від 9*9 до 1*1
        {
            for (int j = 9; j > 0; j --)
            {
                System.out.println(i + " * " + j + " = " + i*j);
            }
        }

        // Создайте двух мерный массив чисел, например int [] [] array = new [4][8]
        // и заполните его данными через вложенные циклы и выведите на экран их значения, если они больше 2, через другие вложенные циклы.
        // т.е. если массив хранит в себе числа 1, 2, 3, 4 - то на экран вывести только 3, 4.

        int [] [] array1 = new int [4] [8]; // Створення двомірного масиву
        for (int i = 0; i < array1.length; i++) // Заповнення двомірного масиву данними
        {
            for (int j = 0; j < array1[i].length; j++)
            {
                array1[i][j] = j + i;
            }
        }
        System.out.println("Це наш двомірний масив: " + Arrays.deepToString(array1)); // Вивід двомірного масиву
        System.out.println("Далі бубуть виводитись елементи масиву які більше 2, по черзі: ");
        for (int i = 0; i < array1.length; i++) // Виводить елементи двомірного масиву якщо вони більше 2 за допоиогою вкладених циклів
        {
            for (int j = 0; j < array1[i].length; j++)
            {
                if (array1[i][j] > 2) {
                    System.out.println(array1[i][j]);
                }
            }
        }

        //Завдання 4. Используя интернет, найдите другой вид сортировки (мы проходили пузырьком)
        // и напишите его вдумываясь во все нюансы, напишите почему такой или иной тип сортировки лучше или хуже

        // Будемо сортувати наш масив за допомогою сортування вставками,
        // бо він проводить менше ітерацій ніж ортування бульбашкою і буде виконуватись швидше.
        // Далі йде сортування нашого першого масиву який заповнюється рандомними значеннями від 1 до 100
        for (int i = 1; i < array.length; i++)
        {
            int k = array[i];
            int j = i - 1;
            while (j >= 0 && array[j] > k)
            {
                array[j + 1] = array[j];
                j = j - 1;
            }
            array[j + 1] = k;
        }
        System.out.println("Відсортований масив: " + Arrays.toString(array));
    }
}
